<script lang="ts" setup>
import { IDocument } from "/@src/services/docs";
import * as _ from "lodash";
import { generateQrCodeFromString } from "/@src/utils";

let props = defineProps<{
  data?: IDocument;
}>();
let groupByCr = computed(() => {
  let data = _.groupBy(
    props.data?.criterion.map((el) => {
      return {
        ...el,
        category_name: el.category.name,
      };
    }),
    "category_name"
  );
  return data;
});
let qrCodeBase64 = generateQrCodeFromString({
  value: `${import.meta.env.VITE_API_BASE_URL}auth/view-doc/${props.data?.key}`,
  size: 50,
  color: "#0363ad",
});

</script>
<template>
  <div>
    <p style="text-align: center">
      <strong>
        Тошкент шаҳар, Чилонзор тумани Бунёдкор кўчаси,
        {{ data?.title }}да олиб борилган илмий-техник назорат тадбирлари натижаси
        юзасидан ишчи гуруҳ томонидан тузилган
      </strong>
    </p>
    <p style="text-align: center"><strong>ДАЛОЛАТНОМА</strong></p>
    <table style="width: 100%">
      <tr style="text-align: center">
        <td>{{ data?.start_date?.split?.(" ")?.[0] }}</td>
        <td style="width: 33%"></td>
        <td style="text-align: right">{{ data?.region?.name }}</td>
      </tr>
    </table>
    <p style="text-indent: 42px">
      <strong style="text-decoration: underline">I. Умумий маълумотлар</strong>
    </p>
    <p style="text-indent: 42px; text-align: justify">
      <strong>1.1.</strong> {{ data?.region.name }} {{ data?.district.name }} <strong>{{ data?.title }}</strong
      > Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2019 йил 4 октябрдаги 846-сон
      қарори билан давлат муҳофазасига олинган.
    </p>
    <p style="text-indent: 42px; text-align: justify">
      <strong>1.2.</strong> Ўзбекистон Республикаси Маданий мерос агентлиги директорининг
      2024 йил 20 февралдаги 46-П-сонли буйруғига мувофиқ, {{ data?.description }}лар
      томонидан юқорида келтирилган маданий мерос объектида илмий-техник назорат тадбири
      олиб борилди.
    </p>
    <p style="text-indent: 42px">
      <strong style="text-decoration: underline"
        >II. Текшириш давомида аниқланган алоҳида ҳолатлар</strong
      >
    </p>
    <p style="text-indent: 42px">
      {{ data?.start_date }} куни Маданий мерос агентлиги директорининг 2024 йил 20
      февралдаги 46-П-сонли буйруғига мувофиқ, Ишчи гуруҳ ташкил этилиб, Тошкент шаҳар,
      Чилонзор тумани, Бунёдкор кўчаси,  XVI асрга оид
      <strong>{{ data?.title }}</strong
      >да илмий-техник назорат тадбири ўтказилди. Мазкур тадбир давомида Ишчи гуруҳ
      томонидан қуйидаги ҳолатлар аниқланди.
    </p>
    <p style="text-indent: 42px">
      Маълумки, Ўзбекистон Республикасининг 2001 йил 30 августдаги
      <strong
        >“Маданий мерос объектларини муҳофаза қилиш ва улардан фойдаланиш
        тўғрисида”</strong
      >ги Қонунининг 10-моддаси, 2-қисми 6-хатбошида моддий маданий мерос объектлари
      жойлашган ерларда ҳамда уларга туташ ҳудудларда ер қазиш, ер тузиш, қурилиш,
      мелиоратсия, хўжалик ишлари ва бошқа ишларни, моддий маданий мерос объектларини
      асраш бўйича ишларни амалга ошириш, шунингдек, моддий маданий мерос объектларида
      илмий ва илмий-техник тадқиқотлар ўтказиш учун рухсатномалар бериш кўзда тутилган.
    </p>
    <p style="text-indent: 42px">
      Шунингдек, Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2019 йил 30 мартдаги
      “Моддий маданий мерос объектларини муҳофаза қилиш ва улардан фойдаланишга оид айрим
      норматив-ҳуқуқий ҳужжатларни тасдиқлаш тўғрисида”ги 265-сон қарори 6-иловаси,
      96-бандида моддий маданий мероснинг кўчмас мулк объектлари ва уларнинг
      қўриқланадиган теграларида ер қазиш, ер тузиш, қурилиш, мелиоратсия ва бошқа хўжалик
      ишлари, асрашга доир ишларни амалга ошириш ҳамда илмий ва илмий-техник тадқиқотлар
      ўтказишга оид лойиҳаларга Маданий мерос агентлиги ҳузуридаги Илмий-эскперт кенгаши
      томонидан хулоса берилиши белгиланган.
    </p>
    <p style="text-indent: 42px">
      Бироқ <strong>{{ data?.title }}</strong> мадрасаси кўздан кечирилганда, Маданий
      мерос агентлиги ҳузуридаги Илмий-эксперт кенгашидан тегишли ҳулоса олмасдан туриб
      ўзбошимчалик билан объектнинг ички қисмининг ўнг ва чап тарафида ҳожатхона ва
      тоҳоратхона кўрилиш ишлари амалга оширилаётгани аниқланди. Жумладан,
    </p>
    <p style="text-indent: 42px">
      <strong>-{{ data?.title }}</strong> 1-қават чап тарафидан ҳожатхона ва тоҳоратхона
      кўрилиши натижасида {{ data?.amount }} м3, ўнг тарафидан ҳожатхона ва тоҳоратхона
      ўрилганлиги натижасида 1,74 м3 девор ҳамда пол қисмига зарар етказилганлиги
      аниқланди.
    </p>
    <p style="text-indent: 42px">
      Ишчи гуруҳ юқоридаги аниқланган хато ва камчиликларни Ўзбекистон Республикаси
      Вазирлар Маҳкамасининг 2019 йил 30 мартдаги 265-сон қарори 8-иловаси билан
      тасдиқланган “Моддий маданий мерос кўчмас мулк объектига етказилган моддий зарар
      миқдорини ҳисоблаш методикаси”га асосан, зарар ҳисоблаб чиқилишини мақсадга мувофиқ
      деб ҳисоблайди.
    </p>
    <p>&nbsp;</p>
    <table style="width: 100%; text-align: center; border-collapse: collapse">
      <tr>
        <td style="border: 1px solid #000"><strong>№</strong></td>
        <td style="border: 1px solid #000"><strong>Иш тури</strong></td>
        <td style="border: 1px solid #000">
          <strong>Етказилган зарар ўлчами (м3 ўлчамида)</strong>
        </td>
      </tr>
      <tr>
        <td style="border: 1px solid #000"></td>
        <td style="border: 1px solid #000">
          <p>Абдулқосим Эшон мадрасасининг ички қисмида хожатхона ва таҳоратхона</p>
          <p>&nbsp;</p>
        </td>
        <td style="border: 1px solid #000">{{ data?.amount }}</td>
      </tr>
      <tr>
        <td style="border: 1px solid #000" colspan="2">
          <strong>ЖАМИ: </strong>
        </td>
        <td style="border: 1px solid #000">
          <strong>{{ data?.amount }} м3 </strong>
        </td>
      </tr>
    </table>
    <p>&nbsp;</p>
    <p style="text-align: center">
      Баҳолаш мезони бўйича қуйидаги баллар йиғиндиси чиқарилди
    </p>
    <table style="width: 100%; border-collapse: collapse">
      <template v-for="(value, key) in groupByCr">
        <tr>
          <td
            colspan="2"
            style="text-align: center; border: 1px dotted #000; padding: 5px"
          >
            {{ key }}
          </td>
        </tr>
        <tr v-for="val in value">
          <td style="border: 1px dotted #000; padding: 5px">{{ val.name }}</td>
          <td style="width: 120px; border: 1px dotted #000; padding: 5px">
            {{ val.rate }}
          </td>
        </tr>
      </template>
    </table>
    <p style="text-indent: 42px">
      Етказилган зарар миқдори Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2019 йил 30
      мартдаги “Ўзбекистон Республикаси Маданият вазирлиги ҳузуридаги Маданий мерос
      департаменти фаолиятини ташкил этиш ҳамда моддий маданий мерос объектларини муҳофаза
      қилиш ва улардан фойдаланишга оид айрим норматив-ҳуқуқий ҳужжатларни тасдиқлаш
      тўғрисида”ги 265-сонли “Моддий маданий мерос кўчмас мулк объектларининг муҳофаза
      қилиниши, асралиши ва улардан фойдаланилиши устидан давлат назоратини амалга ошириш
      тартиби тўғрисида”ги қарорининг низомидаги иловаси “Моддий маданий мерос кўчмас мулк
      объектига етказилган моддий зарар миқдорини ҳисоблаш” методикаси асосида ҳисобланди
      ва моддий маданий мерос кўчмас мулк объектига етказилган моддий зарар миқдори
      қуйидаги формула ёрдамида аниқланди:
    </p>
    <p style="text-align: center"><strong>М=В*У*В*Э+А</strong></p>
    <p style="text-indent: 42px">
      Бунда: М — етказилган зарар миқдори (ўлчов бирлиги — сўм), В — етказилган зарар
      балли (ўлчов бирлиги — балл), У — объект коеффитсиенти (ўлчов бирлиги — м-3 балл
      -1), В — етказилган зарар ҳажми (ўлчов бирлиги — м3), Е — Ўзбекистон Республикаси
      ҳудудидаги энг камиш ҳақи (ўлчов бирлиги — сўм), А — объектнинг алоҳида муҳим бадиий
      безаклари, нақшлар, кошинлар, тасвирлар ва бошқа муҳим жиҳатларига етказилган зарар
      миқдори (ўлчовбирлиги — сўм).
    </p>
    <p style="text-align: center">Етказилган зарар миқдори баҳолаш мезонни:</p>
    <p style="text-indent: 42px">
      Объектга етказилган зарар балли қуйидаги мезонларнинг тегишли баллари йиғиндиси
      бўйича аниқланади:
    </p>
    <p style="text-indent: 42px">
      3.Обектнинг умумбашарий аҳамияти (У) обектнинг ЮНЕСКОнинг Умумжаҳон мероси рўйхатига
      киритилган ҳудудда ёки унинг қўриқланадиган ҳудудида жойлашгани ёхуд обект
      умумбашарий бемисл қимматга эга эканлигига боғлиқ эмаслиги боис ушбу миқдор
      етказилган зарарни ҳисоблаш методикаси формуласида ҳисобланмади.
    </p>
    <p style="text-indent: 42px">
      4.Обектга етказилган зарар ҳажми давлат назоратини амалга ошираётган шахс (ёки
      тайинланган мутахассис ёхуд эксперт) томонидан ўлчов асбобларини қўллаш ёрдамида
      аниқланади. Етказилган зарар ҳажми обектнинг уч ўлчамлик фазовий шакли (масалан,
      хонанинг ички бўш қисмлари билан бирга) бўйича ҳисобланади.
    </p>
    <p style="text-indent: 42px">
      5.Ўзбекистон Республикасидаги базавий ҳисоблаш миқдори қонун ҳужжатларида
      белгиланган миқдор бўйича ҳисобланади ва бунда обектга зарар етказилгани аниқланган
      (давлат назорати ўтказилган) вақтдаги базавий ҳисоблаш миқдори олинади.
    </p>
    <p style="text-indent: 42px">Юқоридаги ҳолатларни инобатга олган ҳолда:</p>
    <p style="text-indent: 42px">
      Юқоридаги зарар етказилган Архитектура ёдгорлиги формула бўйича зарари қуйдагича
      ҳисобланди.
    </p>
    <p style="text-align: center"><strong>Б * У * В * Э = М</strong></p>
    <p style="text-align: center">
      <strong>65 балл*2.97м3*340 000= 65 637 000 сўм</strong>
    </p>
    <p style="text-align: center">
      Юқоридаги ҳолатлар бўйича умумий ҳисобда <strong>65 637 000</strong> (олтмиш беш
      миллион олти юз ўттиз етти минг ) сўм миқдорда зарар етказилган деб баҳоланди.
    </p>
    <p style="text-indent: 42px">
      *А — объектнинг алоҳида муҳим бадиий безаклари, нақшлар, кошинлар, тасвирлар ва
      бошқа муҳим жиҳатларига етказилган зарар миқдори (ўлчовбирлиги — сўм)
      мутахассис(эксперт) ёки махсус комиссия белгиланиши лозимлигини инобатга олган ҳолда
      ушбу миқдор етказилган зарарни ҳисоблаш методикаси формуласида ҳисобланмади.
    </p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <table style="width: 100%;">
      <tr>
      <td style="width: 30%;"></td>
        <td style="vertical-align: middle; width:120px">
          <img :src="qrCodeBase64" alt="" />
        </td>
        <td style="">
          {{ data?.createdBy.first_name }} {{ data?.createdBy.last_name }}
        </td>
      </tr>
    </table>
  </div>
</template>
<style lang="scss"></style>
